app/views/comments/index.html.erb

      <tbody>
        <% @publication.comments.each do |comment| %>
---
SELECT "comments".* FROM "comments" WHERE "comments"."publication_id" = $1  [["publication_id", 4]]