app/controllers/comments_controller.rb

INSERT INTO "comments" ("user_id", "publication_id", "body", "visits_count", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["user_id", 4], ["publication_id", 4], ["body", "holaaaaaaaaa"], ["visits_count", 0], ["created_at", "2018-06-22 19:38:40.651711"], ["updated_at", "2018-06-22 19:38:40.651711"]]
---
  def create
    @comment = current_user.comments.new(comment_params)
    @comment.publication = @publication
    respond_to do |format|
      if @comment.save

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def upvote
    @comment = Comment.find(params[:id])

SELECT  "comments".* FROM "comments" WHERE "comments"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
---
  def downvote
    @comment = Comment.find(params[:id])

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
    def set_publication
      @publication = Publication.find(params[:publication_id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:forum_id])