app/controllers/forums_controller.rb

SELECT "forums".* FROM "forums"
---
	def index
		#@forums = Forum.all  # Article es el modelo y all permite traer todos los registros de la tabla
		#@forums = Forum.where(["title LIKE ?", "%#{params[:search]}%"])
		@forums = Forum.search(params[:search])

UPDATE "forums" SET "visits_count" = $1, "updated_at" = $2 WHERE "forums"."id" = $3  [["visits_count", 59], ["updated_at", "2018-06-22 01:09:02.069005"], ["id", 1]]
SELECT "publications".* FROM "publications" WHERE "publications"."forum_id" = $1  [["forum_id", 1]]
---
	def show  # encuentra un registro por su id
		# @forum = Article.find(params[:id])  # params es un hash
		@forum.update_visits_count
		@publication = Publication.new
		@pubs = @forum.publications
		@publicaciones_foro = @pubs
		@publicaciones_foro = Publication.search(@forum, params[:search])

INSERT INTO "forums" ("title", "body", "created_at", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["title", "Argentina se salvo"], ["body", "aguante nigeria, buu croacia e Islanda"], ["created_at", "2018-06-22 21:13:57.101772"], ["updated_at", "2018-06-22 21:13:57.101772"]]
---
	def create
		@forum = Forum.new(title: params[:forum][:title], body: params[:forum][:body])
		# @article = Article.new(article_params)  # como hicimos def article_params lo colocamos aquí
		# @forum = current_user.forums.new(forum_params)
		if @forum.save

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def suscribir
		user = User.find(current_user.id)
     	@event = Forum.find(params[:forum])

SELECT  "users".* FROM "users" WHERE "users"."id" = $1 ORDER BY "users"."id" ASC LIMIT $2  [["id", 3], ["LIMIT", 1]]
SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
	def desuscribir
		user = User.find(current_user.id)
     	@event = Forum.find(params[:forum])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 5], ["LIMIT", 1]]
---
	def set_forum
		@forum = Forum.find(params[:id])