app/controllers/publications_controller.rb

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
  def edit
    @publication = Publication.find(params[:id])

INSERT INTO "publications" ("title", "body", "visits_count", "created_at", "updated_at", "user_id", "forum_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"
---
  def create
    # @publication = Publication.new(title: params[:publication][:title], body: params[:publication][:body])
    # @publication = Publication.new(publication_params)  # como hicimos def article_params lo colocamos aquí
    # @publication.user_id = current_user.id
    @publication = current_user.publications.new(publication_params)
    @publication.forum = @forum
    respond_to do |format|
      if @publication.save

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
---
  def upvote
    @publication = Publication.find(params[:id])

SELECT  "publications".* FROM "publications" WHERE "publications"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_publication
      @publication = Publication.find(params[:id])

SELECT  "forums".* FROM "forums" WHERE "forums"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]
---
    def set_forum
      @forum = Forum.find(params[:forum_id])